public class Main {
    public static void main(String[] args) {


    }

    public static String InputInfo(){
        Scanner keyboard = new Scanner(System.in);
        System.out.println("enter information");
    }
}

//запрос данных : string ФИО
// DateFormat датарождения   целое беззнаковое int телефон
// string пол f m/
//
// /проверяем по количеству - код ошибки (в методе, который и будет принимать данные)

//распарсить через пробел, выделить типы данных, если форматы не совпллают - брось exc в сотоотв с ошибкой
// - дать пользователю информацию что не верно

//в мейн передеаем пользователю сообщение - ошибка, неправильный ввод, мало или много
//
//все верно:
//создать файл с названием - фамилия. внутри все данные <><><><><>
//одна фамилия у польззователей - ы один файл
//
//закрыть файл

//еслт ошибка с чтпением-записью - обработка через catch и вывод сообщения пользователю